Repository: share-extras/langpack-cy
Catalog: tmx/repository.tmx
Source language: en_us
Languages: cy

source: Encoding ''{0}'' is not supported
cy: Nid yw'r amgodiad "{0}" wedi'i chynnal

source: Copy item to a folder in a web project
cy: Copïo eitem i ffolder mewn project gwe

source: Actions available on workflow package
cy: Gweithredion ar gael ar gyfer y pecyn llif gwaith

source: Fixes link node file extensions to have a .url extension.
cy: Trwsio estyniadau ffeil nodau cyswllt i ychwanegu'r estyniad ".url".

source: Add the guest user, guest home space; and fix permissions on company home, guest home and guest person.
cy: Ychwanegu'r defnyddiwr gwestai, y lle cartref gwestai; a thrwsio caniatadau ar y cartref cwmni, y cartref gwestai a'r person gwestai.

source: Updated {0} version history objects to improve performance.
cy: Wedi diweddaru {0} gwrthrychau hanes fersiwn i wella perfformiad.

source: Unable to find the template ''{0}''. Please contact your system administrator.
cy: Methu canfod y templed "{0}". Cysylltwch â'ch gweinyddwr system, os gwelwch yn dda.

source: Task used to collect information required for initiating Workflow
cy: Tasg a defnyddir i casglu gwybodaerth sydd angen i gychwyn y Llif Gwaith

source: Failed to construct an instance of type ''{0}'' for constraint ''{1}''
cy: Methwyd adeiladu enghraifft o fath "{0}" ar gyfer y cyfyngiad "{1}"

source: Quality Assurance
cy: Sicrhau Ansawdd

source: Ensure that the ''dir.root'' property is pointing to the correct data location.
cy: Sicrhewch bod y priodwedd "dir.root" yn pwyntio i'r lleoliad data cywir.

source: Path
cy: Llwybr

source: The current implementation of the version service only supports one preceeding version.
cy: Mae gweithredoliant cyfredol y gwasanaeth fersiwn yn cynnal un fersiwn blaenorol yn unig.

source: The module properties file ''{0}'' could not be read.
cy: Methu darllen y ffeil priodweddau modiwl "{0}".

source: Found duplicate constraint definition ''{0}'' within property ''{1}''
cy: Wedi canfod diffiniad cyfyngiad dyblyg "{0}" tu fewn priodwedd "{1}"

source: CONTENT INTEGRITY ERROR: System content not found in content store.
cy: GWALL CYFANRWYDD CYNNWYS: Cynnwys system heb ei canfod yn y stôr cynnwys.

source: Repository descriptor updated
cy: Wedi diweddaru'r disgrifydd Repositori

source: Failed to extract the 'to' address: {0}
cy: Methwyd echdynnu'r cyfeiriad 'i': {0}

source: Alfresco Content Repository
cy: Repositori Cynnwys Alfresco

source: The node {0} cannot be restored since it already exists.
cy: Methu adfer y nôd {0} gan fod o'n bodoli eisoes.

source: "Constraint ''{0}'' has both a simple and list value for property ''{1}''
cy: Mae gan y cyfyngiad "{0}" gwerth syml a gwerth rhestredig ar gyfer y priodwedd "{1}"

source: Items with the specified mime type
cy: Eitemau gyda'r math MIME penodol

source: Failed to create MIME message from input stream: {0}
cy: Methwyd creu neges MIME o lif mewnbwn: {0}

source: Reindex wca:webfolder to make wca:avmstore an identifier
cy: Ail-fynegeio wca:webfolder i wneud wca:avmstore yn dynodydd

source: The value ''{0}'' is not an allowed authority name: it is an authority of type: {1}
cy: Nid yw'r gwerth "{0}" yn enw awdurdod a chaniateir: mae yn awdurod o fath: {1}

source: The RSS Templates folder already exists: {0}
cy: Mae'r ffolder 'Templedi RSS' yn bodoli eisoes: {0}

source: Checking for patches to apply ...
cy: Gwrio am gywiriadau i osod...

source: Reject Step
cy: Cam Gwrthod

source: Alfresco Application Model
cy: Model Cymhwysiad Alfresco

source: Necessary web projects added.
cy: Projectau gwe angenrheidiol wedi ychwanegu.

source: The saved searches folder already exists: {0}
cy: Mae'r ffolder 'Chwiliadau a Chadwyd' yn bodoli eisoes: {0}

source: Getting started guide
cy: Arweiniad dechrae

source: Referenceable
cy: Cyfeiradwy

source: This will check out the matched content.
cy: Bydd hwn yn gwirio allan y cynnwys sy'n cydweddu.

source: Allows other repository objects to be attached
cy: Caniatáu atodi gwrthrychau repositori arall

source: Executing database script {0} (Generated).
cy: Gweithredu sgript cronfa ddata {0} (Wedi'i cynhyrchu)

source: Can not find the currently authenticated user details required by the CheckOutCheckIn service.
cy: Methu canfod manylion y defnyddiwr a dilyswyd yn bresennol sydd angen gan y gwasanaeth CheckOutCheckIn.

source: Statement execution failed: SQL: {0} Error: {1} File: {2} Line: {3}
cy: Methwyd gweithredu'r datganiad: SQL: {0} Gwall: {1} Ffeil: {2} Llinell: {3}

source: Can not perform operation {0} since the node (id:{1}) is locked.
cy: Methu perfformio'r gweithrediad {0} gan fod y nôd (id:{1}) wedi'i cloi.

source: Last Accessed Date
cy: Dyddiad Cyrchu Olaf

source: Transformed Items
cy: Eitemau Trawsffufiedig

source: First Name
cy: Enw Cyntaf

source: Workflow Package
cy: Pecyn Llif Gwaith

source: Workflow Assignee
cy: Aseinai Llif Gwaith

source: Author
cy: Awdur

source: Index recovery started: {0} transactions.
cy: Adferiad mynegai wedi dechrae: {0} trafodion.

source: The Person's home folder
cy: Plygell cartref y person

source: Duplicate child name not allowed: {0}
cy: Ni chaniateir enw plentyn dyblyg: {0}

source: Update permissions from 'folder' to 'cmobject' [JIRA: AR-344].
cy: Diweddaru caniatadau o 'folder' i 'cmobject' [JIRA: AR-344].

source: Add simple workflow to item
cy: Ychwanegu llif gwaith syml i eitem

source: The Web Forms folder was successfully created: {0}
cy: Wedi creu'r ffolder 'Ffurflenni Gwe' yn llwyddiannus: {0}

source: Space containing topics
cy: Lle sy'n cynnwys pynciau

source: system-overview.html
cy: trosolwg-system.html

source: Increment the counter property for the item.
cy: Cynyddu priodwedd cownter yr eitem.

source: Adds existing web projects to locking service.
cy: Ychwanegu projectau gwe cyfredol i'r gwasanaeth cloi.

source: Workflow Start Task
cy: Tasg Cychwyn Llif Gwaith

source: Content
cy: Categori

source: Changed {0} 'webfolder' access control entries to 'cmobject'.
cy: Wedi newid {0} cofnod rheoli cyrchu 'webfolder' i 'cmobject'.

source: Content Title
cy: Teitl Cynnwys

source: Marker patch to record installations and upgrades
cy: Cywiriad marciwr y recordio gosodiadau ac uwchraddiadau

source: Configurations
cy: Ffurfweddiadau

source: The original node can not be found. Perhaps the copy has been corrupted or the original has been deleted or moved.
cy: Ni allir canfod y nôd gwreiddiol. Efallai mae'r copi wedi ei llygru neu mae'r copi gwreiddiol wedi ei ddileu neu symud.

source: Not relevant to schema {0}
cy: Dim yn berthnasol i sgema {0}

source: Checks and renames duplicate children.
cy: Gwirio ac ail-enwi plant dyblyg.

source: Reindex usr:authorityContainer members as identifiers=======
cy: Ail-fynegeio aelodau usr:authorityContainer fel dynodyddion=======

source: Locale
cy: Lleoleiddiad

source: Approve Folder
cy: Ffolder Cymeradwyo

source: Ensures the existance of the WCM specific 'Web Projects' and 'Web Forms' folders.
cy: Sicrhau bod y ffolderau WCM 'Projectau Gwe' a 'Ffurflenni Gwe' yn bodoli.

source: Lock Type
cy: Math Clo

source: Move item to a specific space
cy: Symud eitem i le penodol

source: Properties were moved.
cy: Symudwyd priodweddau.

source: The operation {0} can not be applied to a numeric property.
cy: Ni ellir gweithredu'r gweithred {0} ar briodwedd rhifol.

source: Adds Web Scripts to Data Dictionary.
cy: Ychwanegu Sgriptiau Gwe i'r Geiriadur Data.

source: Created Date
cy: Dyddiad Creu

source: Package items marked as complete
cy: Eitemau pecyn sydd wedi'u cwblhau

source: Constraint type ''{0}'' on constraint ''{1}'' is not a well-known type or a valid Constraint implementation
cy: Nid yw math cyfyngiad "{0}" ar gyfyngiad "{1}" yn math cyffredin neu gweithrediad cyfyngiad dilys

source: Whether to flatten to a staging store after revert.
cy: A ddylid lleddfu i stôr llwyfo gwahanol ar ol ddywelyd.

source: Ordered Children
cy: Plant Trefnedig

source: Change Spaces store root permission from 'Consumer' to 'Read'
cy: Newid caniatâd gwraidd stôr lleoedd o 'Consumer' i 'Read'

source: The version to revert to.
cy: Y fersiwn i ddychwelyd i.

source: The Web Projects folder already exists: {0}
cy: Mae'r ffolder 'Projectau Gwe' yn bodoli eisoes: {0}

source: Upgrading module ''{0}'' version {1} (was {2}).
cy: Uwchraddio modiwl "{0}" fersiwn {1} ({2} o'r blaen).

source: Inbound and Update
cy: Derbyniedig a Diweddaru

source: Please ensure that 'replicateUpdates' and 'replicateUpdatesViaCopy' is enabled for the cache 'org.alfresco.cache.ticketsCache'. Check that the general cluster configuration is correct and working.
cy: Os gwelwch yn dda sicrhewch bod 'replicateUpdates' a 'replicateUpdatesViaCopy' wedi eu galluogi ar gyfer y storfa 'org.alfresco.cache.ticketsCache'. Gwnewch yn siwr bod y ffurfweddiad clwstwr yn gywir ac yn gweithio.

source: The Alfresco root data directory (''dir.root'') is: {0}
cy: Cyfeiriadur data gwreiddiol Alfresco ("dir.root") yw: {0}

source: Presentations
cy: Cyflwyniadau

source: Lockable
cy: Cloiadwy

source: The operation {0} can not be applied to a date property.
cy: Ni ellir gweithredu'r gweithred {0} ar briodwedd dyddiad.

source: Imported view into bootstrap location: {0} ({1})
cy: Wedi mewnforio golwg i'r lleoliad cychwyn: {0} ({1})

source: Loads the email templates into the Email Templates folder.
cy: Llwytho'r templedi e-bost i'r ffolder Templedi E-bost.

source: Access Denied. You do not have the appropriate permissions to perform this operation.
cy: Gwrthodwyd Mynediad. Nid oes gennych y caniatadau angenrheidiol i berfformio'r gweithrediad yma.

source: Module ''{0}'' had no install version. Assuming version {1} was installed.
cy: Nid oes gan modiwl "{0}" unrhyw fersiwn gosodiedig. Yn tybio gosodwyd fersiwn {1}.

source: The version provided to revert to does not come from the nodes version history.
cy: Nid yw'r fersiwn a darparwyd i adfer i yn dod o hanes fersiwn y nôd.

source: Successfully removed the uifacets aspect from {0} presentation template files.
cy: Wedi tynnu'r agwedd uifacets o {0} ffeiliau templedi cyflwyniad.

source: Re-deploy WCM Submit Process Definition.
cy: Ail-ddarpru'r Diffiniad Proses Cyflwyno WCM

source: Root Category
cy: Categori Gwreiddiol

source: A content proerty must be specified when comparing to a property of type content.
cy: Rhaid penodi priodwedd cynnwys er mwyn cymharu i priodwedd o fath cynnwys.

source: Summary
cy: Crynodeb

source: Source
cy: Ffynhonnell

source: Property ''{0}'' has not been set: {1}
cy: Nid yw'r priodwedd "{0}" wedi'i gosod: {1}

source: Server ''{0}'' from web project ''{1}'' has been migrated
cy: Wedi mudo gweinydd "{0}" o project gwe "{1}"

source: Web Forms
cy: Ffurflenni Gwe

source: The forum holding the discussion on the object the aspect is applied to
cy: Y fforwm sy'n dal y trafodaeth ar yr eitem mae'r agwedd wedi ei gosod ar

source: The Person's user name
cy: Enw defnyddiwr y person

source: Improves the performance of version history lookups.
cy: Gwella perfformiad o chwiliadau hanes fersiwn.

source: Ensures the existence of the 'Scripts' folder.
cy: Sicrhau bod y ffolder 'Sgriptiau' yn bodoli.

source: Reindex usr:user and cm:person uids as identifiers
cy: Ail-fynegeio uids usr:user a cm:person fel dynodyddion

source: This will check in the matched content.
cy: Bydd hwn yn gwirio i fewn y cynnwys sy'n cydweddu.

source: Reference
cy: Cyfeiriad

source: Changed {0} 'folder' access control entries to 'cmobject'.
cy: Wedi newid {0} cofnod rheoli cyrchu 'folder' i 'cmobject'.

source: Items with the specified category value
cy: Eitemau gyda'r gwerth categori penodol

source: Specialise the type of an item
cy: Arbenigo math eitem

source: Failed to extract the 'sent on' date: {0}
cy: Methwyd echdynnu'r dyddiad 'anfonwyd ar': {0}

source: Transform and copy content to a specific space
cy: Trawsffurfio a chopïo cynnwys i le penodol

source: Contains
cy: Yn Cynnwys

source: RSS templates
cy: Templedi RSS

source: Sub-categories within Category
cy: Is-gategorïau tu fewn Categori

source: Inbound
cy: Derbyniedig

source: Required authority system path not found: {0}
cy: Methwyd canfod llwybr system awdurdod angenrheidiol: {0}

source: You have insufficent privileges to release the lock on the node (id: {0}). The node is locked by another user.
cy: Nid oes gennych digon o breintiau i rhyddhau'r clo ar y nôd (id:{0}). Mae'r nôd wedi cloi gan defnyddiwr arall.

source: This will remove an aspect from the matched item.
cy: Bydd hwn yn tunnu agwedd o'r eitem sy'n cydweddu.

source: Set GUIDs on AVM nodes.
cy: Gosod GUIDs ar nodau AVM.

source: Date and Time
cy: Dyddiad ac Amser

source: Failed to extract the message subject: {0}
cy: Methwyd echdynnu pwnc y neges: {0}

source: Package Item Actions
cy: Gweithredion Eitemau Pecyn

source: Alfresco Repository export of store ''{0}''.
cy: Allforyn Repositori Alfresco o'r stôr "{0}".

source: The value ''{0}'' is not an allowed user name: it is an authority of type: {1}
cy: Nid yw'r gwerth "{0}" yn enw defnyddiwr a ganiateir: mae yn awdurdod o fath: {1}

source: This reverts all the nodes included in the list.
cy: Mae hwn yn dychwelyd pob nôd sydd wedi ei gynnwys yn y rhestr.

source: Attachable
cy: Atodadwy

source: Start Workflow
cy: Cychwyn Llif Gwaith

source: Update Web Scripts ReadMe.
cy: Diweddaru ReadMe Sgriptiau Gwe

source: Adds the 'GROUP_EMAIL_CONTRIBUTORS' group.
cy: Ychwanegu'r grŵp 'GROUP_EMAIL_CONTRIBUTORS'.

source: Transformable
cy: Trawsffurfiadwy

source: Template
cy: Patrymlun

source: User Homes
cy: Cartrefi Defnyddwyr

source: This will submit any newer nodes in the matched item to the corresponding staging.
cy: Bydd hwn yn cyflwyno unrhyw nodau mwy newydd mewn yr eitem sy'n cydweddu i'r ardal llwyfo.

source: Model ''{0}'' does not exist
cy: Nid yw model "{0}" yn bodoli

source: The component ''{0}'' belongs to a non-existent module ''{1}''.
cy: Mae'r cydran "{0}" yn piau i modiwl sydd ddim yn bodoli "{1}".

source: Updated {0} WCM Content Form objects to 'wcm:formfolder' type.
cy: Wedi diweddaru {0} gwrthrych Ffurflen Cynnwys WCM i fath 'wcm:formfolder'.

source: Outcome
cy: Canlyniad

source: Boolean
cy: Boole

source: Fixed {0} link node file extensions. See file {1} for details.
cy: Wedi trwsio {0} estyniad ffeil nodau cyswllt. Gwelwch ffeil {1} am manylion.

source: You do not have access to the item at path {0} it is currently locked by another user.
cy: Nid oes gennych cyrchiad i'r eitem gyda lwybr {0} gan fod o wedi ei gloi gan ddefnyddiwr arall.

source: Hits
cy: Trawiadau

source: Space folder templates
cy: Templedi lle ffolder

source: This will copy the matched item to another space.
cy: Bydd hwn yn copïo'r eitem sy'n cydweddu i le arall.

source: Expired Content In ''{0}''
cy: Cynnwys Wedi Dod i Ben yn "{0}"

source: The node (id: {0}) could not be locked since it is already locked by another user.
cy: Methu cloi'r nôd (id:{0}) gan fod gan fod defnyddiwr arall wedi ei cloi yn barod.

source: Contributor
cy: Cyfrannwr

source: Imported the Email Templates into the default folder.
cy: Wedi mewnforio'r Templedi E-bost i'r ffolder rhagosodedig.

source: Expiry Date
cy: Dyddiad Dod i Ben

source: A previously-installed module ''{0}'' (version {1}) is not present in your distribution.
cy: Nid yw'r modiwl "{0}" (fersiwn {1}) a gosodwyd ynghynt yn presennol yn eich dosbarthiad.

source: Alfresco Tutorial
cy: Tiwtorial Alfresco

source: Icon
cy: Eicon

source: Exports a Space and optionally it's children to an Alfresco export package.
cy: Allforio Lle ac yn dewisol ei plant hefyd i becyn allforyn Alfresco.

source: {0} % complete.
cy: {0} % cyflawn.

source: Constraint reference ''{0}'' not found on constraint ''{1}''
cy: Cyfeirnod cyfyngiad ""{0} heb ei canfod ar cyfyngiad "{1}"

source: The HTTP reader was unable to authenticate on the remote server: {0}
cy: Nid oedd y darllenwr HTTP yn gallu dilysu ar y gweinydd pell: {0}

source: Re-deployed {0} workflows.
cy: Wedi ail-darparu {0} llifiau gwaith.

source: This acts as a mistake eraser for a user's sandbox.
cy: Mae hwn yn ymddwyn fel rwbiwr camgymeriadau ar gyfer blwch tywod defnyddiwr.

source: Auto-fixing of duplicate names failed. See file {0} for details.
cy: Methwyd awto-trwsio enwau dyblyg. Gwelwch ffeil {0} am manylion.

source: Ensures group authorities are visible to everyone.
cy: Sicrhau bod awdurdodau grwpiau yn gweledig i bawb.

source: Store Root
cy: Gwraidd Stôr

source: Added the version properties content to the system descriptor.
cy: Wedi ychwanegu'r cynnwys priodweddau fersiwn i'r disgrifydd system.

source: Reindex wca:webform to make wca:formname an identifier
cy: Ail-fynegeio wca:webform i wneud wca:formname yn dynodydd

source: Coverage
cy: Ymdrin

source: Edit Inline
cy: Golygu Mewn-lein

source: Layered Node indirectionVersions set.
cy: Wedi gosod indirectionVersions Nodau Haenol.

source: The store ''{0}'' has a duplicate root node entry.
cy: Mae gan y stôr "{0}" cofnod nôd gwreiddiol dyblyg.

source: Pending Approval
cy: Disgwyl Cymeradwyo

source: Failed to extract the 'from' address: {0}
cy: Methwyd echdynnu'r cyfeiriad 'o': {0}

source: Identifier
cy: Dynodiad

source: Simple Sandbox Promotion
cy: Dyrchafiad Blwch Tywod Syml

source: Checked {0} associations and fixed {1} duplicates. See file {2} for details.
cy: Wedi gwirio {0} cysylltiadau a thrwsio {1} copïau dyblyg. Gwelwch ffeil {2} am manylion.

source: Workflow Priority
cy: Blaenoriaeth Llif Gwaith

source: Send an email to specified users
cy: Anfon e-bost i defnyddwyr penodol

source: Published
cy: Cyhoeddwyd

source: Granted CONTRIBUTOR role to EVERYONE on 'Saved Searches' folder: {0}.
cy: Wedi addef rôl DARLLENWR i PAWB ar y ffolder 'Chwiliadau a Chadwyd': {0}.

source: The Person's e-mail address
cy: Cyfeiriad e-bost y person

source: This deploys a website to a remote server.
cy: Mae hwn yn darparu safle gwe i weinydd pell.

source: Titled
cy: Teitlwyd

source: The system descriptor could not be found.
cy: Methu canfod y disgrifydd system.

source: Adds the version properties content to the system descriptor.
cy: Ychwanegu'r cynnwys priodweddau fersiwn i'r disgrifydd system.

source: Actions available on workflow package items
cy: Gweithredion ar gael ar gyfer yr eitemau pecyn llif gwaith

source: Complianceable
cy: Cydymffurfiadwy

source: Publisher
cy: Cyhoeddwr

source: Ensures the existence of the 'RSS Templates' folder.
cy: Sicrhau bod y ffolder 'Templedi RSS' yn bodoli.

source: The following schema upgrade script needs to be executed manually: {0}
cy: Rhaid gweithredu'r sgript uwchraddio sgema dilynol â llaw: {0}

source: Ownable
cy: Perchennadwy

source: Ensures that the database upgrade script has been run.
cy: Sicrhau bod y sgript uwchraddio cronfa ddata wedi rhedeg.

source: Failed to parse the email message: {0}
cy: Methwyd dosrannu'r neges e-bost: {0}

source: An error occured while reading the mail message: {0}
cy: Digwyddodd gwall wrth darllen y neges e-bost: {0}

source: {0} module components were not considered for execution.
cy: Ni ymdrinwyd {0} cydrannau modiwl i weithredu.

source: Original Location
cy: Lleoliad Gwreiddiol

source: Samples
cy: Samplau

source: Last Name
cy: Enw Olaf

source: Completed Items
cy: Eitemau wedi'u Cwblhau

source: Items which contain a specific value in its name
cy: Eitemau sy'n cynnwys gwerth penodol yn ei enw

source: Incorrect message part: {0}
cy: Rhan neges anghywir: {0}

source: Archived
cy: Nôd wedi'i Archifo

source: Addressees
cy: Cyfeiryddion

source: The company root space
cy: Y lle cwmni gwreiddiol

source: Content properties must be single-valued
cy: Rhaid i briodweddau cynnwys bod yn gwerthau sengl

source: Copy item to a specific space
cy: Copïo eitem i le penodol

source: Indicates whether the children of the folder are ordered
cy: Os yw plant y ffolder wedi'u trefnu

source: The value is not an allowed value: {0}
cy: Nid yw'r gwerth yn gwerth a ganiateir: {0}

source: Subscribable
cy: Tanysgrifiadwy

source: Update ACLs on all avm objects to the new 2.2 permission model
cy: Newid ACLs ar pob gwrthrych AVM i'r model caniatadau 2.2 newydd

source: Ensure that property values are not stored as Serializable if at all possible
cy: Sicrhau bod gwerthau priodwedd dim yn cael eu storio fel Serializable os bossib

source: Fix ACLs so they are only set on the staging area store.
cy: Trwsio ACLs i'w osod ar y stôr llwyfo yn unig.

source: Presentation templates
cy: Templedi Cyflwyno

source: Failed to find temporary file for export
cy: Methwyd canfod ffeil dros dro ar gyfer allforio

source: The rule is applied to all items that has the specified category value.
cy: Bydd y rheol yma yn cael ei gweithredu ar pob eitem sydd gyda'r gwerth categori penodol.

source: Auto Version
cy: Awto-Fersiynnu

source: More than one Alfresco schema was found when querying the database metadata. Limit the database user's permissions or set the 'hibernate.default_schema' property in 'custom-hibernate-dialect.properties'.
cy: Canfodwyd mwy nag un sgema Alfresco wrth ymholi'r metadata cronfa ddata. Cyfyngwch caniatadau y defnyddiwr cronfa ddata neu gosodwch y priodwedd 'hibernate.default_schema' yn 'custom-hibernate-dialect.properties'.

source: The Person's first name
cy: Enw cyntaf y person

source: Description of what needs to be achieved
cy: Disgrifiad o beth sydd i wneud

source: Attachments
cy: Atodiadau

source: Templatable
cy: Templedadwy

source: Priority
cy: Blaenoriaeth

source: Ensures the existence of the 'Saved Searches' folder.
cy: Sicrhau bod y ffolder 'Chwiliadau a Chadwyd' yn bodoli.

source: Access Denied. The system is currently in read-only mode.
cy: Gwrthodwyd Mynediad. Mae'r system yn modd darllen-yn-unig ar hyn o bryd.

source: === Applied patch === ID: {0} RESULT: {1} =====================================
cy: === Wedi gosod gywiriad === ID: {0} CANLYNIAD: {1} =====================================

source: The node {0} cannot be restore since there is no version information available for this node.
cy: Methu adfer y nôd {0} gan fod yna ddim gwybodaeth fersiwn ar gael ar gyfer y nôd yma.

source: A component named ''{0}'' has already been registered for module ''{1}''.
cy: Mae cydran wedi'i enwi "{0}" wedi ei cofrestru eisoes ar gyfer y modiwl "{1}".

source: Fixed ''{0}'' invalid user nodes, ''{1}'' invalid person nodes and ''{2}'' invalid authority nodes.
cy: Wedi trwsio "{0}" nodau defnyddiwr annilys, "{1}" nodau person annilys a "{2}" nodau awdurdod annilys.

source: Sent Date
cy: Dyddiad Anfon

source: Alfresco content package for complete Repository.
cy: Pecyn cynnwys Alfresco ar gyfer y Repositori cyfan.

source: Email Templates
cy: Templedi E-bost

source: Up a level
cy: Fyny un level

source: Auto-fixing of link node file extensions failed. See file {0} for details.
cy: Methwyd awto-trwsio estyniadau ffeil nodau cyswllt. Gwelwch ffeil {0} am manylion.

source: The scripts folder already exists: {0}
cy: Mae'r ffolder 'Sgriptiau' yn bodoli eisoes: {0}

source: The status object used to determine progress
cy: Y gwrthrych statws a ddefnyddir i ddangos cynnydd

source: Revert a Single Node in a store.
cy: Dychwelyd un nôd mewn stôr.

source: Size
cy: Maint

source: Allows an object to be discussed
cy: Caniateir eitem cael ei trafod

source: The guest root space
cy: Y lle gwestai gwreiddiol

source: Updated ACLs: ACLS are moved to the staging area store and removed from all other stores. They are now applied via layering.
cy: Wedi diweddaru ACLs: Mae ACLs wedi eu symud i'r stôr llwyfo a thynnu o storau eraill. Gosodwyd nawr trwy haenau.

source: When this item was last accessed
cy: Pan cyrchwyd y gwrthrych yma yn olaf

source: Received by SMTP from ''{0}''.
cy: Derbyniwyd trwy SMTP o "{0}".

source: Who last modified this item
cy: Pwy newidiwyd yr eitem yma yn olaf

source: Email-{0}
cy: E-bost-{0}
